In [1]:
import numpy as np
import pandas as pd

In [35]:
df = {'Compay':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
     'Person': ['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
     'Sales':[200,120,340,124,243,350], 'Age':[20,24,34,24,43,35]}

In [18]:
df

{'Compay': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350],
 'Age': [20, 24, 34, 24, 43, 35]}

In [19]:
myDataframe = pd.DataFrame(df)

In [20]:
myDataframe

  Compay   Person  Sales  Age
0   GOOG      Sam    200   20
1   GOOG  Charlie    120   24
2   MSFT      Amy    340   34
3   MSFT  Vanessa    124   24
4     FB     Carl    243   43
5     FB    Sarah    350   35

In [21]:
myDataframe.groupby('Compay')

In [22]:
byCamp=myDataframe.groupby("Compay")

In [39]:
byCamp

In [36]:
byCamp.mean()

        Sales   Age
Compay
FB      296.5  39.0
GOOG    160.0  22.0
MSFT    232.0  29.0

In [37]:
byCamp.mean()

        Sales   Age
Compay
FB      296.5  39.0
GOOG    160.0  22.0
MSFT    232.0  29.0

In [24]:
byCamp.std()

             Sales       Age
Compay
FB       75.660426  5.656854
GOOG     56.568542  2.828427
MSFT    152.735065  7.071068

In [25]:
byCamp.max()

         Person  Sales  Age
Compay
FB        Sarah    350   43
GOOG        Sam    200   24
MSFT    Vanessa    340   34

In [26]:
byCamp['Age'].max()

Compay
FB      43
GOOG    24
MSFT    34
Name: Age, dtype: int64

In [28]:
byCamp['Sales','Person'].min()

        Sales   Person
Compay
FB        243     Carl
GOOG      120  Charlie
MSFT      124      Amy

In [29]:
byCamp.count()

        Person  Sales  Age
Compay
FB           2      2    2
GOOG         2      2    2
MSFT         2      2    2

In [30]:
byCamp.describe()

       Sales                                                           Age  \
       count   mean         std    min     25%    50%     75%    max count
Compay
FB       2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0   2.0
GOOG     2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0   2.0
MSFT     2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0   2.0


        mean       std   min   25%   50%   75%   max
Compay
FB      39.0  5.656854  35.0  37.0  39.0  41.0  43.0
GOOG    22.0  2.828427  20.0  21.0  22.0  23.0  24.0
MSFT    29.0  7.071068  24.0  26.5  29.0  31.5  34.0

In [32]:
byCamp.mean().transpose()['GOOG']

Sales    160.0
Age       22.0
Name: GOOG, dtype: float64

In [33]:
byCamp.describe().transpose()

Compay               FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000
Age   count    2.000000    2.000000    2.000000
      mean    39.000000   22.000000   29.000000
      std      5.656854    2.828427    7.071068
      min     35.000000   20.000000   24.000000
      25%     37.000000   21.000000   26.500000
      50%     39.000000   22.000000   29.000000
      75%     41.000000   23.000000   31.500000
      max     43.000000   24.000000   34.000000

In [41]:
byCamp.transpose().describe()

AttributeError: Cannot access callable attribute 'transpose' of 'DataFrameGroupBy' objects, try using the 'apply' method